In [1]:
import pandas as pd
import seaborn as s

In [2]:
df = s.load_dataset("tips")

## Summary Functions & Map()

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [6]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [7]:
df.tip.describe()

count    244.000000
mean       2.998279
std        1.383638
min        1.000000
25%        2.000000
50%        2.900000
75%        3.562500
max       10.000000
Name: tip, dtype: float64

In [8]:
df.tip.mean()

np.float64(2.99827868852459)

In [9]:
df.day.unique()

['Sun', 'Sat', 'Thur', 'Fri']
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [10]:
df.day.value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [13]:
# map function
numbers = [1, 2, 3, 4, 5]
res = list(map(lambda x:x*2,numbers))

In [14]:
res

[2, 4, 6, 8, 10]

In [15]:
meanOfTotal_bill = df.total_bill.mean()

In [16]:
df["totalBill_mean"] = df.total_bill.map(lambda p: p-meanOfTotal_bill)

In [17]:
df.head()

   total_bill   tip     sex smoker  day    time  size  totalBill_mean
0       16.99  1.01  Female     No  Sun  Dinner     2       -2.795943
1       10.34  1.66    Male     No  Sun  Dinner     3       -9.445943
2       21.01  3.50    Male     No  Sun  Dinner     3        1.224057
3       23.68  3.31    Male     No  Sun  Dinner     2        3.894057
4       24.59  3.61  Female     No  Sun  Dinner     4        4.804057

In [ ]:
# apply()
# def function():
#     pass
# df.apply(function,args="columns"or"index")